homework/Lab02/combustorPimpleCFL1/0/p
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    "splitter|back"
    {
        type            zeroGradient;
    }

    fuel_inlet
    {
        type            zeroGradient;
    }

    sides
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            empty;
    }
}
